apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
#define LEDC_DUTY_R_CH1    0x0007FFFF
#define LEDC_DUTY_R_CH1_M  (LEDC_DUTY_R_CH1_V << LEDC_DUTY_R_CH1_S)
#define LEDC_DUTY_R_CH1_V  0x0007FFFF
#define LEDC_DUTY_R_CH1_S  0

/* LEDC_CH2_CONF0_REG register
 * Configuration register 0 for channel 2
 */

#define LEDC_CH2_CONF0_REG (DR_REG_LEDC_BASE + 0x28)

/* LEDC_TIMER_SEL_CH2 : R/W; bitpos: [1:0]; default: 0;
 * This field is used to select one of timers for channel 2.
 *
 * 0: select timer0
 *
 * 1: select timer1
 *
 * 2: select timer2
 *
 * 3: select timer3
 */

#define LEDC_TIMER_SEL_CH2    0x00000003
#define LEDC_TIMER_SEL_CH2_M  (LEDC_TIMER_SEL_CH2_V << LEDC_TIMER_SEL_CH2_S)
#define LEDC_TIMER_SEL_CH2_V  0x00000003
#define LEDC_TIMER_SEL_CH2_S  0

/* LEDC_SIG_OUT_EN_CH2 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel 2.
 */

#define LEDC_SIG_OUT_EN_CH2    (BIT(2))
#define LEDC_SIG_OUT_EN_CH2_M  (LEDC_SIG_OUT_EN_CH2_V << LEDC_SIG_OUT_EN_CH2_S)
#define LEDC_SIG_OUT_EN_CH2_V  0x00000001
#define LEDC_SIG_OUT_EN_CH2_S  2

/* LEDC_IDLE_LV_CH2 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 2 is inactive.
 */

#define LEDC_IDLE_LV_CH2    (BIT(3))
#define LEDC_IDLE_LV_CH2_M  (LEDC_IDLE_LV_CH2_V << LEDC_IDLE_LV_CH2_S)
#define LEDC_IDLE_LV_CH2_V  0x00000001
#define LEDC_IDLE_LV_CH2_S  3

/* LEDC_PARA_UP_CH2 : WO; bitpos: [4]; default: 0;
 * This bit is used to update register LEDC_CH2_HPOINT and LEDC_CH2_DUTY for
 * channel 2.
 */

#define LEDC_PARA_UP_CH2    (BIT(4))
#define LEDC_PARA_UP_CH2_M  (LEDC_PARA_UP_CH2_V << LEDC_PARA_UP_CH2_S)
#define LEDC_PARA_UP_CH2_V  0x00000001
#define LEDC_PARA_UP_CH2_S  4

/* LEDC_OVF_NUM_CH2 : R/W; bitpos: [14:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus 1.
 *
 * The LEDC_OVF_CNT_CH2_INT interrupt will be triggered when channel 2
 * overflows for (LEDC_OVF_NUM_CH2 + 1) times.
 */

#define LEDC_OVF_NUM_CH2    0x000003FF
#define LEDC_OVF_NUM_CH2_M  (LEDC_OVF_NUM_CH2_V << LEDC_OVF_NUM_CH2_S)
#define LEDC_OVF_NUM_CH2_V  0x000003FF
#define LEDC_OVF_NUM_CH2_S  5

/* LEDC_OVF_CNT_EN_CH2 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel 2.
 */

#define LEDC_OVF_CNT_EN_CH2    (BIT(15))
#define LEDC_OVF_CNT_EN_CH2_M  (LEDC_OVF_CNT_EN_CH2_V << LEDC_OVF_CNT_EN_CH2_S)
#define LEDC_OVF_CNT_EN_CH2_V  0x00000001
#define LEDC_OVF_CNT_EN_CH2_S  15

/* LEDC_OVF_CNT_RESET_CH2 : WO; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel 2.
 */

#define LEDC_OVF_CNT_RESET_CH2    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH2_M  (LEDC_OVF_CNT_RESET_CH2_V << LEDC_OVF_CNT_RESET_CH2_S)
#define LEDC_OVF_CNT_RESET_CH2_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH2_S  16

/* LEDC_OVF_CNT_RESET_ST_CH2 : RO; bitpos: [17]; default: 0;
 * This is the status bit of LEDC_OVF_CNT_RESET_CH2.
 */

#define LEDC_OVF_CNT_RESET_ST_CH2    (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_CH2_M  (LEDC_OVF_CNT_RESET_ST_CH2_V << LEDC_OVF_CNT_RESET_ST_CH2_S)
#define LEDC_OVF_CNT_RESET_ST_CH2_V  0x00000001
#define LEDC_OVF_CNT_RESET_ST_CH2_S  17

/* LEDC_CH2_HPOINT_REG register
 * High point register for channel 2
 */

#define LEDC_CH2_HPOINT_REG (DR_REG_LEDC_BASE + 0x2c)

/* LEDC_HPOINT_CH2 : R/W; bitpos: [13:0]; default: 0;
 * The output value changes to high when the selected timers has reached the
 * value specified by this register.
 */

#define LEDC_HPOINT_CH2    0x00003FFF
#define LEDC_HPOINT_CH2_M  (LEDC_HPOINT_CH2_V << LEDC_HPOINT_CH2_S)
#define LEDC_HPOINT_CH2_V  0x00003FFF
#define LEDC_HPOINT_CH2_S  0

/* LEDC_CH2_DUTY_REG register
 * Initial duty cycle for channel 2
 */

#define LEDC_CH2_DUTY_REG (DR_REG_LEDC_BASE + 0x30)

/* LEDC_DUTY_CH2 : R/W; bitpos: [18:0]; default: 0;
 * This register is used to change the output duty by controlling the Lpoint.
 *
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */

#define LEDC_DUTY_CH2    0x0007FFFF
#define LEDC_DUTY_CH2_M  (LEDC_DUTY_CH2_V << LEDC_DUTY_CH2_S)
#define LEDC_DUTY_CH2_V  0x0007FFFF
#define LEDC_DUTY_CH2_S  0

/* LEDC_CH2_CONF1_REG register
 * Configuration register 1 for channel 2
 */

#define LEDC_CH2_CONF1_REG (DR_REG_LEDC_BASE + 0x34)

/* LEDC_DUTY_SCALE_CH2 : R/W; bitpos: [9:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel 2.
 */

#define LEDC_DUTY_SCALE_CH2    0x000003FF
#define LEDC_DUTY_SCALE_CH2_M  (LEDC_DUTY_SCALE_CH2_V << LEDC_DUTY_SCALE_CH2_S)
#define LEDC_DUTY_SCALE_CH2_V  0x000003FF
#define LEDC_DUTY_SCALE_CH2_S  0

/* LEDC_DUTY_CYCLE_CH2 : R/W; bitpos: [19:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH2 on channel 2.
 */

#define LEDC_DUTY_CYCLE_CH2    0x000003FF
#define LEDC_DUTY_CYCLE_CH2_M  (LEDC_DUTY_CYCLE_CH2_V << LEDC_DUTY_CYCLE_CH2_S)
#define LEDC_DUTY_CYCLE_CH2_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH2_S  10

/* LEDC_DUTY_NUM_CH2 : R/W; bitpos: [29:20]; default: 0;
 * This register is used to control the number of times the duty cycle will
 * be changed.
 */

#define LEDC_DUTY_NUM_CH2    0x000003FF
#define LEDC_DUTY_NUM_CH2_M  (LEDC_DUTY_NUM_CH2_V << LEDC_DUTY_NUM_CH2_S)
#define LEDC_DUTY_NUM_CH2_V  0x000003FF
#define LEDC_DUTY_NUM_CH2_S  20

/* LEDC_DUTY_INC_CH2 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 2. 1: Increase;0: Decrease.
 */

#define LEDC_DUTY_INC_CH2    (BIT(30))
#define LEDC_DUTY_INC_CH2_M  (LEDC_DUTY_INC_CH2_V << LEDC_DUTY_INC_CH2_S)
#define LEDC_DUTY_INC_CH2_V  0x00000001
#define LEDC_DUTY_INC_CH2_S  30

/* LEDC_DUTY_START_CH2 : R/W; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH2_CONF1_REG will start to take effect
 * when this bit is set to 1.
 */

#define LEDC_DUTY_START_CH2    (BIT(31))
#define LEDC_DUTY_START_CH2_M  (LEDC_DUTY_START_CH2_V << LEDC_DUTY_START_CH2_S)
#define LEDC_DUTY_START_CH2_V  0x00000001
#define LEDC_DUTY_START_CH2_S  31

/* LEDC_CH2_DUTY_R_REG register
 * Current duty cycle for channel 2
 */

#define LEDC_CH2_DUTY_R_REG (DR_REG_LEDC_BASE + 0x38)

/* LEDC_DUTY_R_CH2 : RO; bitpos: [18:0]; default: 0;
 * This register stores the current duty of output signal on channel 2.
 */

#define LEDC_DUTY_R_CH2    0x0007FFFF
#define LEDC_DUTY_R_CH2_M  (LEDC_DUTY_R_CH2_V << LEDC_DUTY_R_CH2_S)
#define LEDC_DUTY_R_CH2_V  0x0007FFFF
#define LEDC_DUTY_R_CH2_S  0

/* LEDC_CH3_CONF0_REG register
 * Configuration register 0 for channel 3
 */

#define LEDC_CH3_CONF0_REG (DR_REG_LEDC_BASE + 0x3c)

/* LEDC_TIMER_SEL_CH3 : R/W; bitpos: [1:0]; default: 0;
 * This field is used to select one of timers for channel 3.
 *
 * 0: select timer0
 *
 * 1: select timer1
 *
 * 2: select timer2
 *
 * 3: select timer3
 */

#define LEDC_TIMER_SEL_CH3    0x00000003
#define LEDC_TIMER_SEL_CH3_M  (LEDC_TIMER_SEL_CH3_V << LEDC_TIMER_SEL_CH3_S)
#define LEDC_TIMER_SEL_CH3_V  0x00000003
#define LEDC_TIMER_SEL_CH3_S  0

/* LEDC_SIG_OUT_EN_CH3 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel 3.
 */

