apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
/* LEDC_SIG_OUT_EN_CH4 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel 4.
 */

#define LEDC_SIG_OUT_EN_CH4    (BIT(2))
#define LEDC_SIG_OUT_EN_CH4_M  (LEDC_SIG_OUT_EN_CH4_V << LEDC_SIG_OUT_EN_CH4_S)
#define LEDC_SIG_OUT_EN_CH4_V  0x00000001
#define LEDC_SIG_OUT_EN_CH4_S  2

/* LEDC_IDLE_LV_CH4 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 4 is inactive.
 */

#define LEDC_IDLE_LV_CH4    (BIT(3))
#define LEDC_IDLE_LV_CH4_M  (LEDC_IDLE_LV_CH4_V << LEDC_IDLE_LV_CH4_S)
#define LEDC_IDLE_LV_CH4_V  0x00000001
#define LEDC_IDLE_LV_CH4_S  3

/* LEDC_PARA_UP_CH4 : WO; bitpos: [4]; default: 0;
 * This bit is used to update register LEDC_CH4_HPOINT and LEDC_CH4_DUTY for
 * channel 4.
 */

#define LEDC_PARA_UP_CH4    (BIT(4))
#define LEDC_PARA_UP_CH4_M  (LEDC_PARA_UP_CH4_V << LEDC_PARA_UP_CH4_S)
#define LEDC_PARA_UP_CH4_V  0x00000001
#define LEDC_PARA_UP_CH4_S  4

/* LEDC_OVF_NUM_CH4 : R/W; bitpos: [14:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus 1.
 *
 * The LEDC_OVF_CNT_CH4_INT interrupt will be triggered when channel 4
 * overflows for (LEDC_OVF_NUM_CH4 + 1) times.
 */

#define LEDC_OVF_NUM_CH4    0x000003FF
#define LEDC_OVF_NUM_CH4_M  (LEDC_OVF_NUM_CH4_V << LEDC_OVF_NUM_CH4_S)
#define LEDC_OVF_NUM_CH4_V  0x000003FF
#define LEDC_OVF_NUM_CH4_S  5

/* LEDC_OVF_CNT_EN_CH4 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel 4.
 */

#define LEDC_OVF_CNT_EN_CH4    (BIT(15))
#define LEDC_OVF_CNT_EN_CH4_M  (LEDC_OVF_CNT_EN_CH4_V << LEDC_OVF_CNT_EN_CH4_S)
#define LEDC_OVF_CNT_EN_CH4_V  0x00000001
#define LEDC_OVF_CNT_EN_CH4_S  15

/* LEDC_OVF_CNT_RESET_CH4 : WO; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel 4.
 */

#define LEDC_OVF_CNT_RESET_CH4    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH4_M  (LEDC_OVF_CNT_RESET_CH4_V << LEDC_OVF_CNT_RESET_CH4_S)
#define LEDC_OVF_CNT_RESET_CH4_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH4_S  16

/* LEDC_OVF_CNT_RESET_ST_CH4 : RO; bitpos: [17]; default: 0;
 * This is the status bit of LEDC_OVF_CNT_RESET_CH4.
 */

#define LEDC_OVF_CNT_RESET_ST_CH4    (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_CH4_M  (LEDC_OVF_CNT_RESET_ST_CH4_V << LEDC_OVF_CNT_RESET_ST_CH4_S)
#define LEDC_OVF_CNT_RESET_ST_CH4_V  0x00000001
#define LEDC_OVF_CNT_RESET_ST_CH4_S  17

/* LEDC_CH4_HPOINT_REG register
 * High point register for channel 4
 */

#define LEDC_CH4_HPOINT_REG (DR_REG_LEDC_BASE + 0x54)

/* LEDC_HPOINT_CH4 : R/W; bitpos: [13:0]; default: 0;
 * The output value changes to high when the selected timers has reached the
 * value specified by this register.
 */

#define LEDC_HPOINT_CH4    0x00003FFF
#define LEDC_HPOINT_CH4_M  (LEDC_HPOINT_CH4_V << LEDC_HPOINT_CH4_S)
#define LEDC_HPOINT_CH4_V  0x00003FFF
#define LEDC_HPOINT_CH4_S  0

/* LEDC_CH4_DUTY_REG register
 * Initial duty cycle for channel 4
 */

#define LEDC_CH4_DUTY_REG (DR_REG_LEDC_BASE + 0x58)

/* LEDC_DUTY_CH4 : R/W; bitpos: [18:0]; default: 0;
 * This register is used to change the output duty by controlling the Lpoint.
 *
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */

#define LEDC_DUTY_CH4    0x0007FFFF
#define LEDC_DUTY_CH4_M  (LEDC_DUTY_CH4_V << LEDC_DUTY_CH4_S)
#define LEDC_DUTY_CH4_V  0x0007FFFF
#define LEDC_DUTY_CH4_S  0

/* LEDC_CH4_CONF1_REG register
 * Configuration register 1 for channel 4
 */

#define LEDC_CH4_CONF1_REG (DR_REG_LEDC_BASE + 0x5c)

/* LEDC_DUTY_SCALE_CH4 : R/W; bitpos: [9:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel 4.
 */

#define LEDC_DUTY_SCALE_CH4    0x000003FF
#define LEDC_DUTY_SCALE_CH4_M  (LEDC_DUTY_SCALE_CH4_V << LEDC_DUTY_SCALE_CH4_S)
#define LEDC_DUTY_SCALE_CH4_V  0x000003FF
#define LEDC_DUTY_SCALE_CH4_S  0

/* LEDC_DUTY_CYCLE_CH4 : R/W; bitpos: [19:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH4 on channel 4.
 */

#define LEDC_DUTY_CYCLE_CH4    0x000003FF
#define LEDC_DUTY_CYCLE_CH4_M  (LEDC_DUTY_CYCLE_CH4_V << LEDC_DUTY_CYCLE_CH4_S)
#define LEDC_DUTY_CYCLE_CH4_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH4_S  10

/* LEDC_DUTY_NUM_CH4 : R/W; bitpos: [29:20]; default: 0;
 * This register is used to control the number of times the duty cycle will
 * be changed.
 */

#define LEDC_DUTY_NUM_CH4    0x000003FF
#define LEDC_DUTY_NUM_CH4_M  (LEDC_DUTY_NUM_CH4_V << LEDC_DUTY_NUM_CH4_S)
#define LEDC_DUTY_NUM_CH4_V  0x000003FF
#define LEDC_DUTY_NUM_CH4_S  20

/* LEDC_DUTY_INC_CH4 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 4. 1: Increase;0: Decrease.
 */

#define LEDC_DUTY_INC_CH4    (BIT(30))
#define LEDC_DUTY_INC_CH4_M  (LEDC_DUTY_INC_CH4_V << LEDC_DUTY_INC_CH4_S)
#define LEDC_DUTY_INC_CH4_V  0x00000001
#define LEDC_DUTY_INC_CH4_S  30

/* LEDC_DUTY_START_CH4 : R/W; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH4_CONF1_REG will start to take effect
 * when this bit is set to 1.
 */

#define LEDC_DUTY_START_CH4    (BIT(31))
#define LEDC_DUTY_START_CH4_M  (LEDC_DUTY_START_CH4_V << LEDC_DUTY_START_CH4_S)
#define LEDC_DUTY_START_CH4_V  0x00000001
#define LEDC_DUTY_START_CH4_S  31

/* LEDC_CH4_DUTY_R_REG register
 * Current duty cycle for channel 4
 */

#define LEDC_CH4_DUTY_R_REG (DR_REG_LEDC_BASE + 0x60)

/* LEDC_DUTY_R_CH4 : RO; bitpos: [18:0]; default: 0;
 * This register stores the current duty of output signal on channel 4.
 */

#define LEDC_DUTY_R_CH4    0x0007FFFF
#define LEDC_DUTY_R_CH4_M  (LEDC_DUTY_R_CH4_V << LEDC_DUTY_R_CH4_S)
#define LEDC_DUTY_R_CH4_V  0x0007FFFF
#define LEDC_DUTY_R_CH4_S  0

/* LEDC_CH5_CONF0_REG register
 * Configuration register 0 for channel 5
 */

#define LEDC_CH5_CONF0_REG (DR_REG_LEDC_BASE + 0x64)

/* LEDC_TIMER_SEL_CH5 : R/W; bitpos: [1:0]; default: 0;
 * This field is used to select one of timers for channel 5.
 *
 * 0: select timer0
 *
 * 1: select timer1
 *
 * 2: select timer2
 *
 * 3: select timer3
 */

#define LEDC_TIMER_SEL_CH5    0x00000003
#define LEDC_TIMER_SEL_CH5_M  (LEDC_TIMER_SEL_CH5_V << LEDC_TIMER_SEL_CH5_S)
#define LEDC_TIMER_SEL_CH5_V  0x00000003
#define LEDC_TIMER_SEL_CH5_S  0

/* LEDC_SIG_OUT_EN_CH5 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel 5.
 */

#define LEDC_SIG_OUT_EN_CH5    (BIT(2))
#define LEDC_SIG_OUT_EN_CH5_M  (LEDC_SIG_OUT_EN_CH5_V << LEDC_SIG_OUT_EN_CH5_S)
#define LEDC_SIG_OUT_EN_CH5_V  0x00000001
#define LEDC_SIG_OUT_EN_CH5_S  2

/* LEDC_IDLE_LV_CH5 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 5 is inactive.
 */

#define LEDC_IDLE_LV_CH5    (BIT(3))
#define LEDC_IDLE_LV_CH5_M  (LEDC_IDLE_LV_CH5_V << LEDC_IDLE_LV_CH5_S)
#define LEDC_IDLE_LV_CH5_V  0x00000001
#define LEDC_IDLE_LV_CH5_S  3

