apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
/* LEDC_PARA_UP_CH5 : WO; bitpos: [4]; default: 0;
 * This bit is used to update register LEDC_CH5_HPOINT and LEDC_CH5_DUTY for
 * channel 5.
 */

#define LEDC_PARA_UP_CH5    (BIT(4))
#define LEDC_PARA_UP_CH5_M  (LEDC_PARA_UP_CH5_V << LEDC_PARA_UP_CH5_S)
#define LEDC_PARA_UP_CH5_V  0x00000001
#define LEDC_PARA_UP_CH5_S  4

/* LEDC_OVF_NUM_CH5 : R/W; bitpos: [14:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus 1.
 *
 * The LEDC_OVF_CNT_CH5_INT interrupt will be triggered when channel 5
 * overflows for (LEDC_OVF_NUM_CH5 + 1) times.
 */

#define LEDC_OVF_NUM_CH5    0x000003FF
#define LEDC_OVF_NUM_CH5_M  (LEDC_OVF_NUM_CH5_V << LEDC_OVF_NUM_CH5_S)
#define LEDC_OVF_NUM_CH5_V  0x000003FF
#define LEDC_OVF_NUM_CH5_S  5

/* LEDC_OVF_CNT_EN_CH5 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel 5.
 */

#define LEDC_OVF_CNT_EN_CH5    (BIT(15))
#define LEDC_OVF_CNT_EN_CH5_M  (LEDC_OVF_CNT_EN_CH5_V << LEDC_OVF_CNT_EN_CH5_S)
#define LEDC_OVF_CNT_EN_CH5_V  0x00000001
#define LEDC_OVF_CNT_EN_CH5_S  15

/* LEDC_OVF_CNT_RESET_CH5 : WO; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel 5.
 */

#define LEDC_OVF_CNT_RESET_CH5    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH5_M  (LEDC_OVF_CNT_RESET_CH5_V << LEDC_OVF_CNT_RESET_CH5_S)
#define LEDC_OVF_CNT_RESET_CH5_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH5_S  16

/* LEDC_OVF_CNT_RESET_ST_CH5 : RO; bitpos: [17]; default: 0;
 * This is the status bit of LEDC_OVF_CNT_RESET_CH5.
 */

#define LEDC_OVF_CNT_RESET_ST_CH5    (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_CH5_M  (LEDC_OVF_CNT_RESET_ST_CH5_V << LEDC_OVF_CNT_RESET_ST_CH5_S)
#define LEDC_OVF_CNT_RESET_ST_CH5_V  0x00000001
#define LEDC_OVF_CNT_RESET_ST_CH5_S  17

/* LEDC_CH5_HPOINT_REG register
 * High point register for channel 5
 */

#define LEDC_CH5_HPOINT_REG (DR_REG_LEDC_BASE + 0x68)

/* LEDC_HPOINT_CH5 : R/W; bitpos: [13:0]; default: 0;
 * The output value changes to high when the selected timers has reached the
 * value specified by this register.
 */

#define LEDC_HPOINT_CH5    0x00003FFF
#define LEDC_HPOINT_CH5_M  (LEDC_HPOINT_CH5_V << LEDC_HPOINT_CH5_S)
#define LEDC_HPOINT_CH5_V  0x00003FFF
#define LEDC_HPOINT_CH5_S  0

/* LEDC_CH5_DUTY_REG register
 * Initial duty cycle for channel 5
 */

#define LEDC_CH5_DUTY_REG (DR_REG_LEDC_BASE + 0x6c)

/* LEDC_DUTY_CH5 : R/W; bitpos: [18:0]; default: 0;
 * This register is used to change the output duty by controlling the Lpoint.
 *
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */

#define LEDC_DUTY_CH5    0x0007FFFF
#define LEDC_DUTY_CH5_M  (LEDC_DUTY_CH5_V << LEDC_DUTY_CH5_S)
#define LEDC_DUTY_CH5_V  0x0007FFFF
#define LEDC_DUTY_CH5_S  0

/* LEDC_CH5_CONF1_REG register
 * Configuration register 1 for channel 5
 */

#define LEDC_CH5_CONF1_REG (DR_REG_LEDC_BASE + 0x70)

/* LEDC_DUTY_SCALE_CH5 : R/W; bitpos: [9:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel 5.
 */

#define LEDC_DUTY_SCALE_CH5    0x000003FF
#define LEDC_DUTY_SCALE_CH5_M  (LEDC_DUTY_SCALE_CH5_V << LEDC_DUTY_SCALE_CH5_S)
#define LEDC_DUTY_SCALE_CH5_V  0x000003FF
#define LEDC_DUTY_SCALE_CH5_S  0

/* LEDC_DUTY_CYCLE_CH5 : R/W; bitpos: [19:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH5 on channel 5.
 */

#define LEDC_DUTY_CYCLE_CH5    0x000003FF
#define LEDC_DUTY_CYCLE_CH5_M  (LEDC_DUTY_CYCLE_CH5_V << LEDC_DUTY_CYCLE_CH5_S)
#define LEDC_DUTY_CYCLE_CH5_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH5_S  10

/* LEDC_DUTY_NUM_CH5 : R/W; bitpos: [29:20]; default: 0;
 * This register is used to control the number of times the duty cycle will
 * be changed.
 */

#define LEDC_DUTY_NUM_CH5    0x000003FF
#define LEDC_DUTY_NUM_CH5_M  (LEDC_DUTY_NUM_CH5_V << LEDC_DUTY_NUM_CH5_S)
#define LEDC_DUTY_NUM_CH5_V  0x000003FF
#define LEDC_DUTY_NUM_CH5_S  20

/* LEDC_DUTY_INC_CH5 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 5. 1: Increase;0: Decrease.
 */

#define LEDC_DUTY_INC_CH5    (BIT(30))
#define LEDC_DUTY_INC_CH5_M  (LEDC_DUTY_INC_CH5_V << LEDC_DUTY_INC_CH5_S)
#define LEDC_DUTY_INC_CH5_V  0x00000001
#define LEDC_DUTY_INC_CH5_S  30

/* LEDC_DUTY_START_CH5 : R/W; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH5_CONF1_REG will start to take effect
 * when this bit is set to 1.
 */

#define LEDC_DUTY_START_CH5    (BIT(31))
#define LEDC_DUTY_START_CH5_M  (LEDC_DUTY_START_CH5_V << LEDC_DUTY_START_CH5_S)
#define LEDC_DUTY_START_CH5_V  0x00000001
#define LEDC_DUTY_START_CH5_S  31

/* LEDC_CH5_DUTY_R_REG register
 * Current duty cycle for channel 5
 */

#define LEDC_CH5_DUTY_R_REG (DR_REG_LEDC_BASE + 0x74)

/* LEDC_DUTY_R_CH5 : RO; bitpos: [18:0]; default: 0;
 * This register stores the current duty of output signal on channel 5.
 */

#define LEDC_DUTY_R_CH5    0x0007FFFF
#define LEDC_DUTY_R_CH5_M  (LEDC_DUTY_R_CH5_V << LEDC_DUTY_R_CH5_S)
#define LEDC_DUTY_R_CH5_V  0x0007FFFF
#define LEDC_DUTY_R_CH5_S  0

/* LEDC_CH6_CONF0_REG register
 * Configuration register 0 for channel 6
 */

#define LEDC_CH6_CONF0_REG (DR_REG_LEDC_BASE + 0x78)

/* LEDC_TIMER_SEL_CH6 : R/W; bitpos: [1:0]; default: 0;
 * This field is used to select one of timers for channel 6.
 *
 * 0: select timer0
 *
 * 1: select timer1
 *
 * 2: select timer2
 *
 * 3: select timer3
 */

#define LEDC_TIMER_SEL_CH6    0x00000003
#define LEDC_TIMER_SEL_CH6_M  (LEDC_TIMER_SEL_CH6_V << LEDC_TIMER_SEL_CH6_S)
#define LEDC_TIMER_SEL_CH6_V  0x00000003
#define LEDC_TIMER_SEL_CH6_S  0

/* LEDC_SIG_OUT_EN_CH6 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel 6.
 */

#define LEDC_SIG_OUT_EN_CH6    (BIT(2))
#define LEDC_SIG_OUT_EN_CH6_M  (LEDC_SIG_OUT_EN_CH6_V << LEDC_SIG_OUT_EN_CH6_S)
#define LEDC_SIG_OUT_EN_CH6_V  0x00000001
#define LEDC_SIG_OUT_EN_CH6_S  2

/* LEDC_IDLE_LV_CH6 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 6 is inactive.
 */

#define LEDC_IDLE_LV_CH6    (BIT(3))
#define LEDC_IDLE_LV_CH6_M  (LEDC_IDLE_LV_CH6_V << LEDC_IDLE_LV_CH6_S)
#define LEDC_IDLE_LV_CH6_V  0x00000001
#define LEDC_IDLE_LV_CH6_S  3

/* LEDC_PARA_UP_CH6 : WO; bitpos: [4]; default: 0;
 * This bit is used to update register LEDC_CH6_HPOINT and LEDC_CH6_DUTY for
 * channel 6.
 */

#define LEDC_PARA_UP_CH6    (BIT(4))
#define LEDC_PARA_UP_CH6_M  (LEDC_PARA_UP_CH6_V << LEDC_PARA_UP_CH6_S)
#define LEDC_PARA_UP_CH6_V  0x00000001
#define LEDC_PARA_UP_CH6_S  4

/* LEDC_OVF_NUM_CH6 : R/W; bitpos: [14:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus 1.
 *
 * The LEDC_OVF_CNT_CH6_INT interrupt will be triggered when channel 6
 * overflows for (LEDC_OVF_NUM_CH6 + 1) times.
 */

#define LEDC_OVF_NUM_CH6    0x000003FF
#define LEDC_OVF_NUM_CH6_M  (LEDC_OVF_NUM_CH6_V << LEDC_OVF_NUM_CH6_S)
#define LEDC_OVF_NUM_CH6_V  0x000003FF
#define LEDC_OVF_NUM_CH6_S  5

/* LEDC_OVF_CNT_EN_CH6 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel 6.
 */

