apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
/* LEDC_OVF_CNT_EN_CH7 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel 7.
 */

#define LEDC_OVF_CNT_EN_CH7    (BIT(15))
#define LEDC_OVF_CNT_EN_CH7_M  (LEDC_OVF_CNT_EN_CH7_V << LEDC_OVF_CNT_EN_CH7_S)
#define LEDC_OVF_CNT_EN_CH7_V  0x00000001
#define LEDC_OVF_CNT_EN_CH7_S  15

/* LEDC_OVF_CNT_RESET_CH7 : WO; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel 7.
 */

#define LEDC_OVF_CNT_RESET_CH7    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH7_M  (LEDC_OVF_CNT_RESET_CH7_V << LEDC_OVF_CNT_RESET_CH7_S)
#define LEDC_OVF_CNT_RESET_CH7_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH7_S  16

/* LEDC_OVF_CNT_RESET_ST_CH7 : RO; bitpos: [17]; default: 0;
 * This is the status bit of LEDC_OVF_CNT_RESET_CH7.
 */

#define LEDC_OVF_CNT_RESET_ST_CH7    (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_CH7_M  (LEDC_OVF_CNT_RESET_ST_CH7_V << LEDC_OVF_CNT_RESET_ST_CH7_S)
#define LEDC_OVF_CNT_RESET_ST_CH7_V  0x00000001
#define LEDC_OVF_CNT_RESET_ST_CH7_S  17

/* LEDC_CH7_HPOINT_REG register
 * High point register for channel 7
 */

#define LEDC_CH7_HPOINT_REG (DR_REG_LEDC_BASE + 0x90)

/* LEDC_HPOINT_CH7 : R/W; bitpos: [13:0]; default: 0;
 * The output value changes to high when the selected timers has reached the
 * value specified by this register.
 */

#define LEDC_HPOINT_CH7    0x00003FFF
#define LEDC_HPOINT_CH7_M  (LEDC_HPOINT_CH7_V << LEDC_HPOINT_CH7_S)
#define LEDC_HPOINT_CH7_V  0x00003FFF
#define LEDC_HPOINT_CH7_S  0

/* LEDC_CH7_DUTY_REG register
 * Initial duty cycle for channel 7
 */

#define LEDC_CH7_DUTY_REG (DR_REG_LEDC_BASE + 0x94)

/* LEDC_DUTY_CH7 : R/W; bitpos: [18:0]; default: 0;
 * This register is used to change the output duty by controlling the Lpoint.
 *
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */

#define LEDC_DUTY_CH7    0x0007FFFF
#define LEDC_DUTY_CH7_M  (LEDC_DUTY_CH7_V << LEDC_DUTY_CH7_S)
#define LEDC_DUTY_CH7_V  0x0007FFFF
#define LEDC_DUTY_CH7_S  0

/* LEDC_CH7_CONF1_REG register
 * Configuration register 1 for channel 7
 */

#define LEDC_CH7_CONF1_REG (DR_REG_LEDC_BASE + 0x98)

/* LEDC_DUTY_SCALE_CH7 : R/W; bitpos: [9:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel 7.
 */

#define LEDC_DUTY_SCALE_CH7    0x000003FF
#define LEDC_DUTY_SCALE_CH7_M  (LEDC_DUTY_SCALE_CH7_V << LEDC_DUTY_SCALE_CH7_S)
#define LEDC_DUTY_SCALE_CH7_V  0x000003FF
#define LEDC_DUTY_SCALE_CH7_S  0

/* LEDC_DUTY_CYCLE_CH7 : R/W; bitpos: [19:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH7 on channel 7.
 */

#define LEDC_DUTY_CYCLE_CH7    0x000003FF
#define LEDC_DUTY_CYCLE_CH7_M  (LEDC_DUTY_CYCLE_CH7_V << LEDC_DUTY_CYCLE_CH7_S)
#define LEDC_DUTY_CYCLE_CH7_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH7_S  10

/* LEDC_DUTY_NUM_CH7 : R/W; bitpos: [29:20]; default: 0;
 * This register is used to control the number of times the duty cycle will
 * be changed.
 */

#define LEDC_DUTY_NUM_CH7    0x000003FF
#define LEDC_DUTY_NUM_CH7_M  (LEDC_DUTY_NUM_CH7_V << LEDC_DUTY_NUM_CH7_S)
#define LEDC_DUTY_NUM_CH7_V  0x000003FF
#define LEDC_DUTY_NUM_CH7_S  20

/* LEDC_DUTY_INC_CH7 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 7. 1: Increase;0: Decrease.
 */

#define LEDC_DUTY_INC_CH7    (BIT(30))
#define LEDC_DUTY_INC_CH7_M  (LEDC_DUTY_INC_CH7_V << LEDC_DUTY_INC_CH7_S)
#define LEDC_DUTY_INC_CH7_V  0x00000001
#define LEDC_DUTY_INC_CH7_S  30

/* LEDC_DUTY_START_CH7 : R/W; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH7_CONF1_REG will start to take effect
 * when this bit is set to 1.
 */

#define LEDC_DUTY_START_CH7    (BIT(31))
#define LEDC_DUTY_START_CH7_M  (LEDC_DUTY_START_CH7_V << LEDC_DUTY_START_CH7_S)
#define LEDC_DUTY_START_CH7_V  0x00000001
#define LEDC_DUTY_START_CH7_S  31

/* LEDC_CH7_DUTY_R_REG register
 * Current duty cycle for channel 7
 */

#define LEDC_CH7_DUTY_R_REG (DR_REG_LEDC_BASE + 0x9c)

/* LEDC_DUTY_R_CH7 : RO; bitpos: [18:0]; default: 0;
 * This register stores the current duty of output signal on channel 7.
 */

#define LEDC_DUTY_R_CH7    0x0007FFFF
#define LEDC_DUTY_R_CH7_M  (LEDC_DUTY_R_CH7_V << LEDC_DUTY_R_CH7_S)
#define LEDC_DUTY_R_CH7_V  0x0007FFFF
#define LEDC_DUTY_R_CH7_S  0

/* LEDC_TIMER0_CONF_REG register
 * Timer 0 configuration
 */

#define LEDC_TIMER0_CONF_REG (DR_REG_LEDC_BASE + 0xa0)

/* LEDC_TIMER0_DUTY_RES : R/W; bitpos: [3:0]; default: 0;
 * This register is used to control the range of the counter in timer 0.
 */

#define LEDC_TIMER0_DUTY_RES    0x0000000F
#define LEDC_TIMER0_DUTY_RES_M  (LEDC_TIMER0_DUTY_RES_V << LEDC_TIMER0_DUTY_RES_S)
#define LEDC_TIMER0_DUTY_RES_V  0x0000000F
#define LEDC_TIMER0_DUTY_RES_S  0

/* LEDC_CLK_DIV_TIMER0 : R/W; bitpos: [21:4]; default: 0;
 * This register is used to configure the divisor for the divider in timer 0.
 *
 * The least significant eight bits represent the fractional part.
 */

#define LEDC_CLK_DIV_TIMER0    0x0003FFFF
#define LEDC_CLK_DIV_TIMER0_M  (LEDC_CLK_DIV_TIMER0_V << LEDC_CLK_DIV_TIMER0_S)
#define LEDC_CLK_DIV_TIMER0_V  0x0003FFFF
#define LEDC_CLK_DIV_TIMER0_S  4

/* LEDC_TIMER0_PAUSE : R/W; bitpos: [22]; default: 0;
 * This bit is used to suspend the counter in timer 0.
 */

#define LEDC_TIMER0_PAUSE    (BIT(22))
#define LEDC_TIMER0_PAUSE_M  (LEDC_TIMER0_PAUSE_V << LEDC_TIMER0_PAUSE_S)
#define LEDC_TIMER0_PAUSE_V  0x00000001
#define LEDC_TIMER0_PAUSE_S  22

/* LEDC_TIMER0_RST : R/W; bitpos: [23]; default: 1;
 * This bit is used to reset timer 0. The counter will show 0 after reset.
 */

#define LEDC_TIMER0_RST    (BIT(23))
#define LEDC_TIMER0_RST_M  (LEDC_TIMER0_RST_V << LEDC_TIMER0_RST_S)
#define LEDC_TIMER0_RST_V  0x00000001
#define LEDC_TIMER0_RST_S  23

/* LEDC_TICK_SEL_TIMER0 : R/W; bitpos: [24]; default: 0;
 * This bit is used to select clock for timer 0. When this bit is set to 1
 * LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not
 * accurate.
 *
 * 1'h0: SLOW_CLK 1'h1: REF_TICK
 */

