apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
#define LEDC_TICK_SEL_TIMER0    (BIT(24))
#define LEDC_TICK_SEL_TIMER0_M  (LEDC_TICK_SEL_TIMER0_V << LEDC_TICK_SEL_TIMER0_S)
#define LEDC_TICK_SEL_TIMER0_V  0x00000001
#define LEDC_TICK_SEL_TIMER0_S  24

/* LEDC_TIMER0_PARA_UP : WO; bitpos: [25]; default: 0;
 * Set this bit to update LEDC_CLK_DIV_TIMER0 and LEDC_TIMER0_DUTY_RES.
 */

#define LEDC_TIMER0_PARA_UP    (BIT(25))
#define LEDC_TIMER0_PARA_UP_M  (LEDC_TIMER0_PARA_UP_V << LEDC_TIMER0_PARA_UP_S)
#define LEDC_TIMER0_PARA_UP_V  0x00000001
#define LEDC_TIMER0_PARA_UP_S  25

/* LEDC_TIMER0_VALUE_REG register
 * Timer 0 current counter value
 */

#define LEDC_TIMER0_VALUE_REG (DR_REG_LEDC_BASE + 0xa4)

/* LEDC_TIMER0_CNT : RO; bitpos: [13:0]; default: 0;
 * This register stores the current counter value of timer 0.
 */

#define LEDC_TIMER0_CNT    0x00003FFF
#define LEDC_TIMER0_CNT_M  (LEDC_TIMER0_CNT_V << LEDC_TIMER0_CNT_S)
#define LEDC_TIMER0_CNT_V  0x00003FFF
#define LEDC_TIMER0_CNT_S  0

/* LEDC_TIMER1_CONF_REG register
 * Timer 1 configuration
 */

#define LEDC_TIMER1_CONF_REG (DR_REG_LEDC_BASE + 0xa8)

/* LEDC_TIMER1_DUTY_RES : R/W; bitpos: [3:0]; default: 0;
 * This register is used to control the range of the counter in timer 1.
 */

#define LEDC_TIMER1_DUTY_RES    0x0000000F
#define LEDC_TIMER1_DUTY_RES_M  (LEDC_TIMER1_DUTY_RES_V << LEDC_TIMER1_DUTY_RES_S)
#define LEDC_TIMER1_DUTY_RES_V  0x0000000F
#define LEDC_TIMER1_DUTY_RES_S  0

/* LEDC_CLK_DIV_TIMER1 : R/W; bitpos: [21:4]; default: 0;
 * This register is used to configure the divisor for the divider in timer 1.
 *
 * The least significant eight bits represent the fractional part.
 */

#define LEDC_CLK_DIV_TIMER1    0x0003FFFF
#define LEDC_CLK_DIV_TIMER1_M  (LEDC_CLK_DIV_TIMER1_V << LEDC_CLK_DIV_TIMER1_S)
#define LEDC_CLK_DIV_TIMER1_V  0x0003FFFF
#define LEDC_CLK_DIV_TIMER1_S  4

/* LEDC_TIMER1_PAUSE : R/W; bitpos: [22]; default: 0;
 * This bit is used to suspend the counter in timer 1.
 */

#define LEDC_TIMER1_PAUSE    (BIT(22))
#define LEDC_TIMER1_PAUSE_M  (LEDC_TIMER1_PAUSE_V << LEDC_TIMER1_PAUSE_S)
#define LEDC_TIMER1_PAUSE_V  0x00000001
#define LEDC_TIMER1_PAUSE_S  22

/* LEDC_TIMER1_RST : R/W; bitpos: [23]; default: 1;
 * This bit is used to reset timer 1. The counter will show 0 after reset.
 */

#define LEDC_TIMER1_RST    (BIT(23))
#define LEDC_TIMER1_RST_M  (LEDC_TIMER1_RST_V << LEDC_TIMER1_RST_S)
#define LEDC_TIMER1_RST_V  0x00000001
#define LEDC_TIMER1_RST_S  23

/* LEDC_TICK_SEL_TIMER1 : R/W; bitpos: [24]; default: 0;
 * This bit is used to select clock for timer 1. When this bit is set to 1
 * LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not
 * accurate.
 *
 * 1'h0: SLOW_CLK 1'h1: REF_TICK
 */

#define LEDC_TICK_SEL_TIMER1    (BIT(24))
#define LEDC_TICK_SEL_TIMER1_M  (LEDC_TICK_SEL_TIMER1_V << LEDC_TICK_SEL_TIMER1_S)
#define LEDC_TICK_SEL_TIMER1_V  0x00000001
#define LEDC_TICK_SEL_TIMER1_S  24

/* LEDC_TIMER1_PARA_UP : WO; bitpos: [25]; default: 0;
 * Set this bit to update LEDC_CLK_DIV_TIMER1 and LEDC_TIMER1_DUTY_RES.
 */

#define LEDC_TIMER1_PARA_UP    (BIT(25))
#define LEDC_TIMER1_PARA_UP_M  (LEDC_TIMER1_PARA_UP_V << LEDC_TIMER1_PARA_UP_S)
#define LEDC_TIMER1_PARA_UP_V  0x00000001
#define LEDC_TIMER1_PARA_UP_S  25

/* LEDC_TIMER1_VALUE_REG register
 * Timer 1 current counter value
 */

#define LEDC_TIMER1_VALUE_REG (DR_REG_LEDC_BASE + 0xac)

/* LEDC_TIMER1_CNT : RO; bitpos: [13:0]; default: 0;
 * This register stores the current counter value of timer 1.
 */

#define LEDC_TIMER1_CNT    0x00003FFF
#define LEDC_TIMER1_CNT_M  (LEDC_TIMER1_CNT_V << LEDC_TIMER1_CNT_S)
#define LEDC_TIMER1_CNT_V  0x00003FFF
#define LEDC_TIMER1_CNT_S  0

/* LEDC_TIMER2_CONF_REG register
 * Timer 2 configuration
 */

#define LEDC_TIMER2_CONF_REG (DR_REG_LEDC_BASE + 0xb0)

/* LEDC_TIMER2_DUTY_RES : R/W; bitpos: [3:0]; default: 0;
 * This register is used to control the range of the counter in timer 2.
 */

#define LEDC_TIMER2_DUTY_RES    0x0000000F
#define LEDC_TIMER2_DUTY_RES_M  (LEDC_TIMER2_DUTY_RES_V << LEDC_TIMER2_DUTY_RES_S)
#define LEDC_TIMER2_DUTY_RES_V  0x0000000F
#define LEDC_TIMER2_DUTY_RES_S  0

/* LEDC_CLK_DIV_TIMER2 : R/W; bitpos: [21:4]; default: 0;
 * This register is used to configure the divisor for the divider in timer 2.
 *
 * The least significant eight bits represent the fractional part.
 */

#define LEDC_CLK_DIV_TIMER2    0x0003FFFF
#define LEDC_CLK_DIV_TIMER2_M  (LEDC_CLK_DIV_TIMER2_V << LEDC_CLK_DIV_TIMER2_S)
#define LEDC_CLK_DIV_TIMER2_V  0x0003FFFF
#define LEDC_CLK_DIV_TIMER2_S  4

/* LEDC_TIMER2_PAUSE : R/W; bitpos: [22]; default: 0;
 * This bit is used to suspend the counter in timer 2.
 */

#define LEDC_TIMER2_PAUSE    (BIT(22))
#define LEDC_TIMER2_PAUSE_M  (LEDC_TIMER2_PAUSE_V << LEDC_TIMER2_PAUSE_S)
#define LEDC_TIMER2_PAUSE_V  0x00000001
#define LEDC_TIMER2_PAUSE_S  22

/* LEDC_TIMER2_RST : R/W; bitpos: [23]; default: 1;
 * This bit is used to reset timer 2. The counter will show 0 after reset.
 */

#define LEDC_TIMER2_RST    (BIT(23))
#define LEDC_TIMER2_RST_M  (LEDC_TIMER2_RST_V << LEDC_TIMER2_RST_S)
#define LEDC_TIMER2_RST_V  0x00000001
#define LEDC_TIMER2_RST_S  23

/* LEDC_TICK_SEL_TIMER2 : R/W; bitpos: [24]; default: 0;
 * This bit is used to select clock for timer 2. When this bit is set to 1
 * LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not
 * accurate.
 *
 * 1'h0: SLOW_CLK 1'h1: REF_TICK
 */

#define LEDC_TICK_SEL_TIMER2    (BIT(24))
#define LEDC_TICK_SEL_TIMER2_M  (LEDC_TICK_SEL_TIMER2_V << LEDC_TICK_SEL_TIMER2_S)
#define LEDC_TICK_SEL_TIMER2_V  0x00000001
#define LEDC_TICK_SEL_TIMER2_S  24

/* LEDC_TIMER2_PARA_UP : WO; bitpos: [25]; default: 0;
 * Set this bit to update LEDC_CLK_DIV_TIMER2 and LEDC_TIMER2_DUTY_RES.
 */

#define LEDC_TIMER2_PARA_UP    (BIT(25))
#define LEDC_TIMER2_PARA_UP_M  (LEDC_TIMER2_PARA_UP_V << LEDC_TIMER2_PARA_UP_S)
#define LEDC_TIMER2_PARA_UP_V  0x00000001
#define LEDC_TIMER2_PARA_UP_S  25

/* LEDC_TIMER2_VALUE_REG register
 * Timer 2 current counter value
 */

#define LEDC_TIMER2_VALUE_REG (DR_REG_LEDC_BASE + 0xb4)

/* LEDC_TIMER2_CNT : RO; bitpos: [13:0]; default: 0;
 * This register stores the current counter value of timer 2.
 */

#define LEDC_TIMER2_CNT    0x00003FFF
#define LEDC_TIMER2_CNT_M  (LEDC_TIMER2_CNT_V << LEDC_TIMER2_CNT_S)
#define LEDC_TIMER2_CNT_V  0x00003FFF
#define LEDC_TIMER2_CNT_S  0

/* LEDC_TIMER3_CONF_REG register
 * Timer 3 configuration
 */

#define LEDC_TIMER3_CONF_REG (DR_REG_LEDC_BASE + 0xb8)

/* LEDC_TIMER3_DUTY_RES : R/W; bitpos: [3:0]; default: 0;
 * This register is used to control the range of the counter in timer 3.
 */

#define LEDC_TIMER3_DUTY_RES    0x0000000F
#define LEDC_TIMER3_DUTY_RES_M  (LEDC_TIMER3_DUTY_RES_V << LEDC_TIMER3_DUTY_RES_S)
#define LEDC_TIMER3_DUTY_RES_V  0x0000000F
#define LEDC_TIMER3_DUTY_RES_S  0

