apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
/* LEDC_CLK_DIV_TIMER3 : R/W; bitpos: [21:4]; default: 0;
 * This register is used to configure the divisor for the divider in timer 3.
 *
 * The least significant eight bits represent the fractional part.
 */

#define LEDC_CLK_DIV_TIMER3    0x0003FFFF
#define LEDC_CLK_DIV_TIMER3_M  (LEDC_CLK_DIV_TIMER3_V << LEDC_CLK_DIV_TIMER3_S)
#define LEDC_CLK_DIV_TIMER3_V  0x0003FFFF
#define LEDC_CLK_DIV_TIMER3_S  4

/* LEDC_TIMER3_PAUSE : R/W; bitpos: [22]; default: 0;
 * This bit is used to suspend the counter in timer 3.
 */

#define LEDC_TIMER3_PAUSE    (BIT(22))
#define LEDC_TIMER3_PAUSE_M  (LEDC_TIMER3_PAUSE_V << LEDC_TIMER3_PAUSE_S)
#define LEDC_TIMER3_PAUSE_V  0x00000001
#define LEDC_TIMER3_PAUSE_S  22

/* LEDC_TIMER3_RST : R/W; bitpos: [23]; default: 1;
 * This bit is used to reset timer 3. The counter will show 0 after reset.
 */

#define LEDC_TIMER3_RST    (BIT(23))
#define LEDC_TIMER3_RST_M  (LEDC_TIMER3_RST_V << LEDC_TIMER3_RST_S)
#define LEDC_TIMER3_RST_V  0x00000001
#define LEDC_TIMER3_RST_S  23

/* LEDC_TICK_SEL_TIMER3 : R/W; bitpos: [24]; default: 0;
 * This bit is used to select clock for timer 3. When this bit is set to 1
 * LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not
 * accurate.
 *
 * 1'h0: SLOW_CLK 1'h1: REF_TICK
 */

#define LEDC_TICK_SEL_TIMER3    (BIT(24))
#define LEDC_TICK_SEL_TIMER3_M  (LEDC_TICK_SEL_TIMER3_V << LEDC_TICK_SEL_TIMER3_S)
#define LEDC_TICK_SEL_TIMER3_V  0x00000001
#define LEDC_TICK_SEL_TIMER3_S  24

/* LEDC_TIMER3_PARA_UP : WO; bitpos: [25]; default: 0;
 * Set this bit to update LEDC_CLK_DIV_TIMER3 and LEDC_TIMER3_DUTY_RES.
 */

#define LEDC_TIMER3_PARA_UP    (BIT(25))
#define LEDC_TIMER3_PARA_UP_M  (LEDC_TIMER3_PARA_UP_V << LEDC_TIMER3_PARA_UP_S)
#define LEDC_TIMER3_PARA_UP_V  0x00000001
#define LEDC_TIMER3_PARA_UP_S  25

/* LEDC_TIMER3_VALUE_REG register
 * Timer 3 current counter value
 */

#define LEDC_TIMER3_VALUE_REG (DR_REG_LEDC_BASE + 0xbc)

/* LEDC_TIMER3_CNT : RO; bitpos: [13:0]; default: 0;
 * This register stores the current counter value of timer 3.
 */

#define LEDC_TIMER3_CNT    0x00003FFF
#define LEDC_TIMER3_CNT_M  (LEDC_TIMER3_CNT_V << LEDC_TIMER3_CNT_S)
#define LEDC_TIMER3_CNT_V  0x00003FFF
#define LEDC_TIMER3_CNT_S  0

/* LEDC_INT_RAW_REG register
 * Raw interrupt status
 */

#define LEDC_INT_RAW_REG (DR_REG_LEDC_BASE + 0xc0)

/* LEDC_TIMER0_OVF_INT_RAW : RO; bitpos: [0]; default: 0;
 * Triggered when the timer0 has reached its maximum counter value.
 */

#define LEDC_TIMER0_OVF_INT_RAW    (BIT(0))
#define LEDC_TIMER0_OVF_INT_RAW_M  (LEDC_TIMER0_OVF_INT_RAW_V << LEDC_TIMER0_OVF_INT_RAW_S)
#define LEDC_TIMER0_OVF_INT_RAW_V  0x00000001
#define LEDC_TIMER0_OVF_INT_RAW_S  0

/* LEDC_TIMER1_OVF_INT_RAW : RO; bitpos: [1]; default: 0;
 * Triggered when the timer1 has reached its maximum counter value.
 */

#define LEDC_TIMER1_OVF_INT_RAW    (BIT(1))
#define LEDC_TIMER1_OVF_INT_RAW_M  (LEDC_TIMER1_OVF_INT_RAW_V << LEDC_TIMER1_OVF_INT_RAW_S)
#define LEDC_TIMER1_OVF_INT_RAW_V  0x00000001
#define LEDC_TIMER1_OVF_INT_RAW_S  1

/* LEDC_TIMER2_OVF_INT_RAW : RO; bitpos: [2]; default: 0;
 * Triggered when the timer2 has reached its maximum counter value.
 */

#define LEDC_TIMER2_OVF_INT_RAW    (BIT(2))
#define LEDC_TIMER2_OVF_INT_RAW_M  (LEDC_TIMER2_OVF_INT_RAW_V << LEDC_TIMER2_OVF_INT_RAW_S)
#define LEDC_TIMER2_OVF_INT_RAW_V  0x00000001
#define LEDC_TIMER2_OVF_INT_RAW_S  2

/* LEDC_TIMER3_OVF_INT_RAW : RO; bitpos: [3]; default: 0;
 * Triggered when the timer3 has reached its maximum counter value.
 */

#define LEDC_TIMER3_OVF_INT_RAW    (BIT(3))
#define LEDC_TIMER3_OVF_INT_RAW_M  (LEDC_TIMER3_OVF_INT_RAW_V << LEDC_TIMER3_OVF_INT_RAW_S)
#define LEDC_TIMER3_OVF_INT_RAW_V  0x00000001
#define LEDC_TIMER3_OVF_INT_RAW_S  3

/* LEDC_DUTY_CHNG_END_CH0_INT_RAW : RO; bitpos: [4]; default: 0;
 * Interrupt raw bit for channel 0. Triggered when the gradual change of
 * duty has finished.
 */

#define LEDC_DUTY_CHNG_END_CH0_INT_RAW    (BIT(4))
#define LEDC_DUTY_CHNG_END_CH0_INT_RAW_M  (LEDC_DUTY_CHNG_END_CH0_INT_RAW_V << LEDC_DUTY_CHNG_END_CH0_INT_RAW_S)
#define LEDC_DUTY_CHNG_END_CH0_INT_RAW_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH0_INT_RAW_S  4

/* LEDC_DUTY_CHNG_END_CH1_INT_RAW : RO; bitpos: [5]; default: 0;
 * Interrupt raw bit for channel 1. Triggered when the gradual change of
 * duty has finished.
 */

#define LEDC_DUTY_CHNG_END_CH1_INT_RAW    (BIT(5))
#define LEDC_DUTY_CHNG_END_CH1_INT_RAW_M  (LEDC_DUTY_CHNG_END_CH1_INT_RAW_V << LEDC_DUTY_CHNG_END_CH1_INT_RAW_S)
#define LEDC_DUTY_CHNG_END_CH1_INT_RAW_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH1_INT_RAW_S  5

/* LEDC_DUTY_CHNG_END_CH2_INT_RAW : RO; bitpos: [6]; default: 0;
 * Interrupt raw bit for channel 2. Triggered when the gradual change of
 * duty has finished.
 */

#define LEDC_DUTY_CHNG_END_CH2_INT_RAW    (BIT(6))
#define LEDC_DUTY_CHNG_END_CH2_INT_RAW_M  (LEDC_DUTY_CHNG_END_CH2_INT_RAW_V << LEDC_DUTY_CHNG_END_CH2_INT_RAW_S)
#define LEDC_DUTY_CHNG_END_CH2_INT_RAW_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH2_INT_RAW_S  6

/* LEDC_DUTY_CHNG_END_CH3_INT_RAW : RO; bitpos: [7]; default: 0;
 * Interrupt raw bit for channel 3. Triggered when the gradual change of
 * duty has finished.
 */

#define LEDC_DUTY_CHNG_END_CH3_INT_RAW    (BIT(7))
#define LEDC_DUTY_CHNG_END_CH3_INT_RAW_M  (LEDC_DUTY_CHNG_END_CH3_INT_RAW_V << LEDC_DUTY_CHNG_END_CH3_INT_RAW_S)
#define LEDC_DUTY_CHNG_END_CH3_INT_RAW_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH3_INT_RAW_S  7

/* LEDC_DUTY_CHNG_END_CH4_INT_RAW : RO; bitpos: [8]; default: 0;
 * Interrupt raw bit for channel 4. Triggered when the gradual change of
 * duty has finished.
 */

#define LEDC_DUTY_CHNG_END_CH4_INT_RAW    (BIT(8))
#define LEDC_DUTY_CHNG_END_CH4_INT_RAW_M  (LEDC_DUTY_CHNG_END_CH4_INT_RAW_V << LEDC_DUTY_CHNG_END_CH4_INT_RAW_S)
#define LEDC_DUTY_CHNG_END_CH4_INT_RAW_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH4_INT_RAW_S  8

/* LEDC_DUTY_CHNG_END_CH5_INT_RAW : RO; bitpos: [9]; default: 0;
 * Interrupt raw bit for channel 5. Triggered when the gradual change of
 * duty has finished.
 */

#define LEDC_DUTY_CHNG_END_CH5_INT_RAW    (BIT(9))
#define LEDC_DUTY_CHNG_END_CH5_INT_RAW_M  (LEDC_DUTY_CHNG_END_CH5_INT_RAW_V << LEDC_DUTY_CHNG_END_CH5_INT_RAW_S)
#define LEDC_DUTY_CHNG_END_CH5_INT_RAW_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH5_INT_RAW_S  9

/* LEDC_DUTY_CHNG_END_CH6_INT_RAW : RO; bitpos: [10]; default: 0;
 * Interrupt raw bit for channel 6. Triggered when the gradual change of
 * duty has finished.
 */

#define LEDC_DUTY_CHNG_END_CH6_INT_RAW    (BIT(10))
#define LEDC_DUTY_CHNG_END_CH6_INT_RAW_M  (LEDC_DUTY_CHNG_END_CH6_INT_RAW_V << LEDC_DUTY_CHNG_END_CH6_INT_RAW_S)
#define LEDC_DUTY_CHNG_END_CH6_INT_RAW_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH6_INT_RAW_S  10

