apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
/* LEDC_DUTY_CHNG_END_CH7_INT_RAW : RO; bitpos: [11]; default: 0;
 * Interrupt raw bit for channel 7. Triggered when the gradual change of
 * duty has finished.
 */

#define LEDC_DUTY_CHNG_END_CH7_INT_RAW    (BIT(11))
#define LEDC_DUTY_CHNG_END_CH7_INT_RAW_M  (LEDC_DUTY_CHNG_END_CH7_INT_RAW_V << LEDC_DUTY_CHNG_END_CH7_INT_RAW_S)
#define LEDC_DUTY_CHNG_END_CH7_INT_RAW_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH7_INT_RAW_S  11

/* LEDC_OVF_CNT_CH0_INT_RAW : RO; bitpos: [12]; default: 0;
 * Interrupt raw bit for channel 0. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH0.
 */

#define LEDC_OVF_CNT_CH0_INT_RAW    (BIT(12))
#define LEDC_OVF_CNT_CH0_INT_RAW_M  (LEDC_OVF_CNT_CH0_INT_RAW_V << LEDC_OVF_CNT_CH0_INT_RAW_S)
#define LEDC_OVF_CNT_CH0_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH0_INT_RAW_S  12

/* LEDC_OVF_CNT_CH1_INT_RAW : RO; bitpos: [13]; default: 0;
 * Interrupt raw bit for channel 1. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH1.
 */

#define LEDC_OVF_CNT_CH1_INT_RAW    (BIT(13))
#define LEDC_OVF_CNT_CH1_INT_RAW_M  (LEDC_OVF_CNT_CH1_INT_RAW_V << LEDC_OVF_CNT_CH1_INT_RAW_S)
#define LEDC_OVF_CNT_CH1_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH1_INT_RAW_S  13

/* LEDC_OVF_CNT_CH2_INT_RAW : RO; bitpos: [14]; default: 0;
 * Interrupt raw bit for channel 2. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH2.
 */

#define LEDC_OVF_CNT_CH2_INT_RAW    (BIT(14))
#define LEDC_OVF_CNT_CH2_INT_RAW_M  (LEDC_OVF_CNT_CH2_INT_RAW_V << LEDC_OVF_CNT_CH2_INT_RAW_S)
#define LEDC_OVF_CNT_CH2_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH2_INT_RAW_S  14

/* LEDC_OVF_CNT_CH3_INT_RAW : RO; bitpos: [15]; default: 0;
 * Interrupt raw bit for channel 3. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH3.
 */

#define LEDC_OVF_CNT_CH3_INT_RAW    (BIT(15))
#define LEDC_OVF_CNT_CH3_INT_RAW_M  (LEDC_OVF_CNT_CH3_INT_RAW_V << LEDC_OVF_CNT_CH3_INT_RAW_S)
#define LEDC_OVF_CNT_CH3_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH3_INT_RAW_S  15

/* LEDC_OVF_CNT_CH4_INT_RAW : RO; bitpos: [16]; default: 0;
 * Interrupt raw bit for channel 4. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH4.
 */

#define LEDC_OVF_CNT_CH4_INT_RAW    (BIT(16))
#define LEDC_OVF_CNT_CH4_INT_RAW_M  (LEDC_OVF_CNT_CH4_INT_RAW_V << LEDC_OVF_CNT_CH4_INT_RAW_S)
#define LEDC_OVF_CNT_CH4_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH4_INT_RAW_S  16

/* LEDC_OVF_CNT_CH5_INT_RAW : RO; bitpos: [17]; default: 0;
 * Interrupt raw bit for channel 5. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH5.
 */

#define LEDC_OVF_CNT_CH5_INT_RAW    (BIT(17))
#define LEDC_OVF_CNT_CH5_INT_RAW_M  (LEDC_OVF_CNT_CH5_INT_RAW_V << LEDC_OVF_CNT_CH5_INT_RAW_S)
#define LEDC_OVF_CNT_CH5_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH5_INT_RAW_S  17

/* LEDC_OVF_CNT_CH6_INT_RAW : RO; bitpos: [18]; default: 0;
 * Interrupt raw bit for channel 6. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH6.
 */

#define LEDC_OVF_CNT_CH6_INT_RAW    (BIT(18))
#define LEDC_OVF_CNT_CH6_INT_RAW_M  (LEDC_OVF_CNT_CH6_INT_RAW_V << LEDC_OVF_CNT_CH6_INT_RAW_S)
#define LEDC_OVF_CNT_CH6_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH6_INT_RAW_S  18

/* LEDC_OVF_CNT_CH7_INT_RAW : RO; bitpos: [19]; default: 0;
 * Interrupt raw bit for channel 7. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH7.
 */

#define LEDC_OVF_CNT_CH7_INT_RAW    (BIT(19))
#define LEDC_OVF_CNT_CH7_INT_RAW_M  (LEDC_OVF_CNT_CH7_INT_RAW_V << LEDC_OVF_CNT_CH7_INT_RAW_S)
#define LEDC_OVF_CNT_CH7_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH7_INT_RAW_S  19

/* LEDC_INT_ST_REG register
 * Masked interrupt status
 */

#define LEDC_INT_ST_REG (DR_REG_LEDC_BASE + 0xc4)

/* LEDC_TIMER0_OVF_INT_ST : RO; bitpos: [0]; default: 0;
 * This is the masked interrupt status bit for the LEDC_TIMER0_OVF_INT
 * interrupt when LEDC_TIMER0_OVF_INT_ENA is set to 1.
 */

#define LEDC_TIMER0_OVF_INT_ST    (BIT(0))
#define LEDC_TIMER0_OVF_INT_ST_M  (LEDC_TIMER0_OVF_INT_ST_V << LEDC_TIMER0_OVF_INT_ST_S)
#define LEDC_TIMER0_OVF_INT_ST_V  0x00000001
#define LEDC_TIMER0_OVF_INT_ST_S  0

/* LEDC_TIMER1_OVF_INT_ST : RO; bitpos: [1]; default: 0;
 * This is the masked interrupt status bit for the LEDC_TIMER1_OVF_INT
 * interrupt when LEDC_TIMER1_OVF_INT_ENA is set to 1.
 */

#define LEDC_TIMER1_OVF_INT_ST    (BIT(1))
#define LEDC_TIMER1_OVF_INT_ST_M  (LEDC_TIMER1_OVF_INT_ST_V << LEDC_TIMER1_OVF_INT_ST_S)
#define LEDC_TIMER1_OVF_INT_ST_V  0x00000001
#define LEDC_TIMER1_OVF_INT_ST_S  1

/* LEDC_TIMER2_OVF_INT_ST : RO; bitpos: [2]; default: 0;
 * This is the masked interrupt status bit for the LEDC_TIMER2_OVF_INT
 * interrupt when LEDC_TIMER2_OVF_INT_ENA is set to 1.
 */

#define LEDC_TIMER2_OVF_INT_ST    (BIT(2))
#define LEDC_TIMER2_OVF_INT_ST_M  (LEDC_TIMER2_OVF_INT_ST_V << LEDC_TIMER2_OVF_INT_ST_S)
#define LEDC_TIMER2_OVF_INT_ST_V  0x00000001
#define LEDC_TIMER2_OVF_INT_ST_S  2

/* LEDC_TIMER3_OVF_INT_ST : RO; bitpos: [3]; default: 0;
 * This is the masked interrupt status bit for the LEDC_TIMER3_OVF_INT
 * interrupt when LEDC_TIMER3_OVF_INT_ENA is set to 1.
 */

#define LEDC_TIMER3_OVF_INT_ST    (BIT(3))
#define LEDC_TIMER3_OVF_INT_ST_M  (LEDC_TIMER3_OVF_INT_ST_V << LEDC_TIMER3_OVF_INT_ST_S)
#define LEDC_TIMER3_OVF_INT_ST_V  0x00000001
#define LEDC_TIMER3_OVF_INT_ST_S  3

/* LEDC_DUTY_CHNG_END_CH0_INT_ST : RO; bitpos: [4]; default: 0;
 * This is the masked interrupt status bit for the
 * LEDC_DUTY_CHNG_END_CH0_INT interrupt when
 * LEDC_DUTY_CHNG_END_CH0_INT_ENAIS set to 1.
 */

#define LEDC_DUTY_CHNG_END_CH0_INT_ST    (BIT(4))
#define LEDC_DUTY_CHNG_END_CH0_INT_ST_M  (LEDC_DUTY_CHNG_END_CH0_INT_ST_V << LEDC_DUTY_CHNG_END_CH0_INT_ST_S)
#define LEDC_DUTY_CHNG_END_CH0_INT_ST_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH0_INT_ST_S  4

/* LEDC_DUTY_CHNG_END_CH1_INT_ST : RO; bitpos: [5]; default: 0;
 * This is the masked interrupt status bit for the
 * LEDC_DUTY_CHNG_END_CH1_INT interrupt when
 * LEDC_DUTY_CHNG_END_CH1_INT_ENAIS set to 1.
 */

#define LEDC_DUTY_CHNG_END_CH1_INT_ST    (BIT(5))
#define LEDC_DUTY_CHNG_END_CH1_INT_ST_M  (LEDC_DUTY_CHNG_END_CH1_INT_ST_V << LEDC_DUTY_CHNG_END_CH1_INT_ST_S)
#define LEDC_DUTY_CHNG_END_CH1_INT_ST_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH1_INT_ST_S  5

