apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
/* LEDC_DUTY_CHNG_END_CH2_INT_ST : RO; bitpos: [6]; default: 0;
 * This is the masked interrupt status bit for the
 * LEDC_DUTY_CHNG_END_CH2_INT interrupt when
 * LEDC_DUTY_CHNG_END_CH2_INT_ENAIS set to 1.
 */

#define LEDC_DUTY_CHNG_END_CH2_INT_ST    (BIT(6))
#define LEDC_DUTY_CHNG_END_CH2_INT_ST_M  (LEDC_DUTY_CHNG_END_CH2_INT_ST_V << LEDC_DUTY_CHNG_END_CH2_INT_ST_S)
#define LEDC_DUTY_CHNG_END_CH2_INT_ST_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH2_INT_ST_S  6

/* LEDC_DUTY_CHNG_END_CH3_INT_ST : RO; bitpos: [7]; default: 0;
 * This is the masked interrupt status bit for the
 * LEDC_DUTY_CHNG_END_CH3_INT interrupt when
 * LEDC_DUTY_CHNG_END_CH3_INT_ENAIS set to 1.
 */

#define LEDC_DUTY_CHNG_END_CH3_INT_ST    (BIT(7))
#define LEDC_DUTY_CHNG_END_CH3_INT_ST_M  (LEDC_DUTY_CHNG_END_CH3_INT_ST_V << LEDC_DUTY_CHNG_END_CH3_INT_ST_S)
#define LEDC_DUTY_CHNG_END_CH3_INT_ST_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH3_INT_ST_S  7

/* LEDC_DUTY_CHNG_END_CH4_INT_ST : RO; bitpos: [8]; default: 0;
 * This is the masked interrupt status bit for the
 * LEDC_DUTY_CHNG_END_CH4_INT interrupt when
 * LEDC_DUTY_CHNG_END_CH4_INT_ENAIS set to 1.
 */

#define LEDC_DUTY_CHNG_END_CH4_INT_ST    (BIT(8))
#define LEDC_DUTY_CHNG_END_CH4_INT_ST_M  (LEDC_DUTY_CHNG_END_CH4_INT_ST_V << LEDC_DUTY_CHNG_END_CH4_INT_ST_S)
#define LEDC_DUTY_CHNG_END_CH4_INT_ST_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH4_INT_ST_S  8

/* LEDC_DUTY_CHNG_END_CH5_INT_ST : RO; bitpos: [9]; default: 0;
 * This is the masked interrupt status bit for the
 * LEDC_DUTY_CHNG_END_CH5_INT interrupt when
 * LEDC_DUTY_CHNG_END_CH5_INT_ENAIS set to 1.
 */

#define LEDC_DUTY_CHNG_END_CH5_INT_ST    (BIT(9))
#define LEDC_DUTY_CHNG_END_CH5_INT_ST_M  (LEDC_DUTY_CHNG_END_CH5_INT_ST_V << LEDC_DUTY_CHNG_END_CH5_INT_ST_S)
#define LEDC_DUTY_CHNG_END_CH5_INT_ST_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH5_INT_ST_S  9

/* LEDC_DUTY_CHNG_END_CH6_INT_ST : RO; bitpos: [10]; default: 0;
 * This is the masked interrupt status bit for the
 * LEDC_DUTY_CHNG_END_CH6_INT interrupt when
 * LEDC_DUTY_CHNG_END_CH6_INT_ENAIS set to 1.
 */

#define LEDC_DUTY_CHNG_END_CH6_INT_ST    (BIT(10))
#define LEDC_DUTY_CHNG_END_CH6_INT_ST_M  (LEDC_DUTY_CHNG_END_CH6_INT_ST_V << LEDC_DUTY_CHNG_END_CH6_INT_ST_S)
#define LEDC_DUTY_CHNG_END_CH6_INT_ST_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH6_INT_ST_S  10

/* LEDC_DUTY_CHNG_END_CH7_INT_ST : RO; bitpos: [11]; default: 0;
 * This is the masked interrupt status bit for the
 * LEDC_DUTY_CHNG_END_CH7_INT interrupt when
 * LEDC_DUTY_CHNG_END_CH7_INT_ENAIS set to 1.
 */

#define LEDC_DUTY_CHNG_END_CH7_INT_ST    (BIT(11))
#define LEDC_DUTY_CHNG_END_CH7_INT_ST_M  (LEDC_DUTY_CHNG_END_CH7_INT_ST_V << LEDC_DUTY_CHNG_END_CH7_INT_ST_S)
#define LEDC_DUTY_CHNG_END_CH7_INT_ST_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH7_INT_ST_S  11

/* LEDC_OVF_CNT_CH0_INT_ST : RO; bitpos: [12]; default: 0;
 * This is the masked interrupt status bit for the LEDC_OVF_CNT_CH0_INT
 * interrupt when LEDC_OVF_CNT_CH0_INT_ENA is set to 1.
 */

#define LEDC_OVF_CNT_CH0_INT_ST    (BIT(12))
#define LEDC_OVF_CNT_CH0_INT_ST_M  (LEDC_OVF_CNT_CH0_INT_ST_V << LEDC_OVF_CNT_CH0_INT_ST_S)
#define LEDC_OVF_CNT_CH0_INT_ST_V  0x00000001
#define LEDC_OVF_CNT_CH0_INT_ST_S  12

/* LEDC_OVF_CNT_CH1_INT_ST : RO; bitpos: [13]; default: 0;
 * This is the masked interrupt status bit for the LEDC_OVF_CNT_CH1_INT
 * interrupt when LEDC_OVF_CNT_CH1_INT_ENA is set to 1.
 */

#define LEDC_OVF_CNT_CH1_INT_ST    (BIT(13))
#define LEDC_OVF_CNT_CH1_INT_ST_M  (LEDC_OVF_CNT_CH1_INT_ST_V << LEDC_OVF_CNT_CH1_INT_ST_S)
#define LEDC_OVF_CNT_CH1_INT_ST_V  0x00000001
#define LEDC_OVF_CNT_CH1_INT_ST_S  13

/* LEDC_OVF_CNT_CH2_INT_ST : RO; bitpos: [14]; default: 0;
 * This is the masked interrupt status bit for the LEDC_OVF_CNT_CH2_INT
 * interrupt when LEDC_OVF_CNT_CH2_INT_ENA is set to 1.
 */

#define LEDC_OVF_CNT_CH2_INT_ST    (BIT(14))
#define LEDC_OVF_CNT_CH2_INT_ST_M  (LEDC_OVF_CNT_CH2_INT_ST_V << LEDC_OVF_CNT_CH2_INT_ST_S)
#define LEDC_OVF_CNT_CH2_INT_ST_V  0x00000001
#define LEDC_OVF_CNT_CH2_INT_ST_S  14

/* LEDC_OVF_CNT_CH3_INT_ST : RO; bitpos: [15]; default: 0;
 * This is the masked interrupt status bit for the LEDC_OVF_CNT_CH3_INT
 * interrupt when LEDC_OVF_CNT_CH3_INT_ENA is set to 1.
 */

#define LEDC_OVF_CNT_CH3_INT_ST    (BIT(15))
#define LEDC_OVF_CNT_CH3_INT_ST_M  (LEDC_OVF_CNT_CH3_INT_ST_V << LEDC_OVF_CNT_CH3_INT_ST_S)
#define LEDC_OVF_CNT_CH3_INT_ST_V  0x00000001
#define LEDC_OVF_CNT_CH3_INT_ST_S  15

/* LEDC_OVF_CNT_CH4_INT_ST : RO; bitpos: [16]; default: 0;
 * This is the masked interrupt status bit for the LEDC_OVF_CNT_CH4_INT
 * interrupt when LEDC_OVF_CNT_CH4_INT_ENA is set to 1.
 */

#define LEDC_OVF_CNT_CH4_INT_ST    (BIT(16))
#define LEDC_OVF_CNT_CH4_INT_ST_M  (LEDC_OVF_CNT_CH4_INT_ST_V << LEDC_OVF_CNT_CH4_INT_ST_S)
#define LEDC_OVF_CNT_CH4_INT_ST_V  0x00000001
#define LEDC_OVF_CNT_CH4_INT_ST_S  16

/* LEDC_OVF_CNT_CH5_INT_ST : RO; bitpos: [17]; default: 0;
 * This is the masked interrupt status bit for the LEDC_OVF_CNT_CH5_INT
 * interrupt when LEDC_OVF_CNT_CH5_INT_ENA is set to 1.
 */

#define LEDC_OVF_CNT_CH5_INT_ST    (BIT(17))
#define LEDC_OVF_CNT_CH5_INT_ST_M  (LEDC_OVF_CNT_CH5_INT_ST_V << LEDC_OVF_CNT_CH5_INT_ST_S)
#define LEDC_OVF_CNT_CH5_INT_ST_V  0x00000001
#define LEDC_OVF_CNT_CH5_INT_ST_S  17

/* LEDC_OVF_CNT_CH6_INT_ST : RO; bitpos: [18]; default: 0;
 * This is the masked interrupt status bit for the LEDC_OVF_CNT_CH6_INT
 * interrupt when LEDC_OVF_CNT_CH6_INT_ENA is set to 1.
 */

#define LEDC_OVF_CNT_CH6_INT_ST    (BIT(18))
#define LEDC_OVF_CNT_CH6_INT_ST_M  (LEDC_OVF_CNT_CH6_INT_ST_V << LEDC_OVF_CNT_CH6_INT_ST_S)
#define LEDC_OVF_CNT_CH6_INT_ST_V  0x00000001
#define LEDC_OVF_CNT_CH6_INT_ST_S  18

/* LEDC_OVF_CNT_CH7_INT_ST : RO; bitpos: [19]; default: 0;
 * This is the masked interrupt status bit for the LEDC_OVF_CNT_CH7_INT
 * interrupt when LEDC_OVF_CNT_CH7_INT_ENA is set to 1.
 */

#define LEDC_OVF_CNT_CH7_INT_ST    (BIT(19))
#define LEDC_OVF_CNT_CH7_INT_ST_M  (LEDC_OVF_CNT_CH7_INT_ST_V << LEDC_OVF_CNT_CH7_INT_ST_S)
#define LEDC_OVF_CNT_CH7_INT_ST_V  0x00000001
#define LEDC_OVF_CNT_CH7_INT_ST_S  19

/* LEDC_INT_ENA_REG register
 * Interrupt enable bits
 */

