apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
#define LEDC_OVF_CNT_CH6_INT_ENA    (BIT(18))
#define LEDC_OVF_CNT_CH6_INT_ENA_M  (LEDC_OVF_CNT_CH6_INT_ENA_V << LEDC_OVF_CNT_CH6_INT_ENA_S)
#define LEDC_OVF_CNT_CH6_INT_ENA_V  0x00000001
#define LEDC_OVF_CNT_CH6_INT_ENA_S  18

/* LEDC_OVF_CNT_CH7_INT_ENA : R/W; bitpos: [19]; default: 0;
 * The interrupt enable bit for the LEDC_OVF_CNT_CH7_INT interrupt.
 */

#define LEDC_OVF_CNT_CH7_INT_ENA    (BIT(19))
#define LEDC_OVF_CNT_CH7_INT_ENA_M  (LEDC_OVF_CNT_CH7_INT_ENA_V << LEDC_OVF_CNT_CH7_INT_ENA_S)
#define LEDC_OVF_CNT_CH7_INT_ENA_V  0x00000001
#define LEDC_OVF_CNT_CH7_INT_ENA_S  19

/* LEDC_INT_CLR_REG register
 * Interrupt clear bits
 */

#define LEDC_INT_CLR_REG (DR_REG_LEDC_BASE + 0xcc)

/* LEDC_TIMER0_OVF_INT_CLR : WO; bitpos: [0]; default: 0;
 * Set this bit to clear the LEDC_TIMER0_OVF_INT interrupt.
 */

#define LEDC_TIMER0_OVF_INT_CLR    (BIT(0))
#define LEDC_TIMER0_OVF_INT_CLR_M  (LEDC_TIMER0_OVF_INT_CLR_V << LEDC_TIMER0_OVF_INT_CLR_S)
#define LEDC_TIMER0_OVF_INT_CLR_V  0x00000001
#define LEDC_TIMER0_OVF_INT_CLR_S  0

/* LEDC_TIMER1_OVF_INT_CLR : WO; bitpos: [1]; default: 0;
 * Set this bit to clear the LEDC_TIMER1_OVF_INT interrupt.
 */

#define LEDC_TIMER1_OVF_INT_CLR    (BIT(1))
#define LEDC_TIMER1_OVF_INT_CLR_M  (LEDC_TIMER1_OVF_INT_CLR_V << LEDC_TIMER1_OVF_INT_CLR_S)
#define LEDC_TIMER1_OVF_INT_CLR_V  0x00000001
#define LEDC_TIMER1_OVF_INT_CLR_S  1

/* LEDC_TIMER2_OVF_INT_CLR : WO; bitpos: [2]; default: 0;
 * Set this bit to clear the LEDC_TIMER2_OVF_INT interrupt.
 */

#define LEDC_TIMER2_OVF_INT_CLR    (BIT(2))
#define LEDC_TIMER2_OVF_INT_CLR_M  (LEDC_TIMER2_OVF_INT_CLR_V << LEDC_TIMER2_OVF_INT_CLR_S)
#define LEDC_TIMER2_OVF_INT_CLR_V  0x00000001
#define LEDC_TIMER2_OVF_INT_CLR_S  2

/* LEDC_TIMER3_OVF_INT_CLR : WO; bitpos: [3]; default: 0;
 * Set this bit to clear the LEDC_TIMER3_OVF_INT interrupt.
 */

#define LEDC_TIMER3_OVF_INT_CLR    (BIT(3))
#define LEDC_TIMER3_OVF_INT_CLR_M  (LEDC_TIMER3_OVF_INT_CLR_V << LEDC_TIMER3_OVF_INT_CLR_S)
#define LEDC_TIMER3_OVF_INT_CLR_V  0x00000001
#define LEDC_TIMER3_OVF_INT_CLR_S  3

/* LEDC_DUTY_CHNG_END_CH0_INT_CLR : WO; bitpos: [4]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH0_INT interrupt.
 */

#define LEDC_DUTY_CHNG_END_CH0_INT_CLR    (BIT(4))
#define LEDC_DUTY_CHNG_END_CH0_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH0_INT_CLR_V << LEDC_DUTY_CHNG_END_CH0_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH0_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH0_INT_CLR_S  4

/* LEDC_DUTY_CHNG_END_CH1_INT_CLR : WO; bitpos: [5]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH1_INT interrupt.
 */

#define LEDC_DUTY_CHNG_END_CH1_INT_CLR    (BIT(5))
#define LEDC_DUTY_CHNG_END_CH1_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH1_INT_CLR_V << LEDC_DUTY_CHNG_END_CH1_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH1_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH1_INT_CLR_S  5

/* LEDC_DUTY_CHNG_END_CH2_INT_CLR : WO; bitpos: [6]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH2_INT interrupt.
 */

#define LEDC_DUTY_CHNG_END_CH2_INT_CLR    (BIT(6))
#define LEDC_DUTY_CHNG_END_CH2_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH2_INT_CLR_V << LEDC_DUTY_CHNG_END_CH2_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH2_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH2_INT_CLR_S  6

/* LEDC_DUTY_CHNG_END_CH3_INT_CLR : WO; bitpos: [7]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH3_INT interrupt.
 */

#define LEDC_DUTY_CHNG_END_CH3_INT_CLR    (BIT(7))
#define LEDC_DUTY_CHNG_END_CH3_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH3_INT_CLR_V << LEDC_DUTY_CHNG_END_CH3_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH3_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH3_INT_CLR_S  7

/* LEDC_DUTY_CHNG_END_CH4_INT_CLR : WO; bitpos: [8]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH4_INT interrupt.
 */

#define LEDC_DUTY_CHNG_END_CH4_INT_CLR    (BIT(8))
#define LEDC_DUTY_CHNG_END_CH4_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH4_INT_CLR_V << LEDC_DUTY_CHNG_END_CH4_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH4_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH4_INT_CLR_S  8

/* LEDC_DUTY_CHNG_END_CH5_INT_CLR : WO; bitpos: [9]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH5_INT interrupt.
 */

#define LEDC_DUTY_CHNG_END_CH5_INT_CLR    (BIT(9))
#define LEDC_DUTY_CHNG_END_CH5_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH5_INT_CLR_V << LEDC_DUTY_CHNG_END_CH5_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH5_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH5_INT_CLR_S  9

/* LEDC_DUTY_CHNG_END_CH6_INT_CLR : WO; bitpos: [10]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH6_INT interrupt.
 */

#define LEDC_DUTY_CHNG_END_CH6_INT_CLR    (BIT(10))
#define LEDC_DUTY_CHNG_END_CH6_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH6_INT_CLR_V << LEDC_DUTY_CHNG_END_CH6_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH6_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH6_INT_CLR_S  10

/* LEDC_DUTY_CHNG_END_CH7_INT_CLR : WO; bitpos: [11]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH7_INT interrupt.
 */

#define LEDC_DUTY_CHNG_END_CH7_INT_CLR    (BIT(11))
#define LEDC_DUTY_CHNG_END_CH7_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH7_INT_CLR_V << LEDC_DUTY_CHNG_END_CH7_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH7_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH7_INT_CLR_S  11

/* LEDC_OVF_CNT_CH0_INT_CLR : WO; bitpos: [12]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH0_INT interrupt.
 */

#define LEDC_OVF_CNT_CH0_INT_CLR    (BIT(12))
#define LEDC_OVF_CNT_CH0_INT_CLR_M  (LEDC_OVF_CNT_CH0_INT_CLR_V << LEDC_OVF_CNT_CH0_INT_CLR_S)
#define LEDC_OVF_CNT_CH0_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH0_INT_CLR_S  12

/* LEDC_OVF_CNT_CH1_INT_CLR : WO; bitpos: [13]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH1_INT interrupt.
 */

#define LEDC_OVF_CNT_CH1_INT_CLR    (BIT(13))
#define LEDC_OVF_CNT_CH1_INT_CLR_M  (LEDC_OVF_CNT_CH1_INT_CLR_V << LEDC_OVF_CNT_CH1_INT_CLR_S)
#define LEDC_OVF_CNT_CH1_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH1_INT_CLR_S  13

/* LEDC_OVF_CNT_CH2_INT_CLR : WO; bitpos: [14]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH2_INT interrupt.
 */

#define LEDC_OVF_CNT_CH2_INT_CLR    (BIT(14))
#define LEDC_OVF_CNT_CH2_INT_CLR_M  (LEDC_OVF_CNT_CH2_INT_CLR_V << LEDC_OVF_CNT_CH2_INT_CLR_S)
#define LEDC_OVF_CNT_CH2_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH2_INT_CLR_S  14

/* LEDC_OVF_CNT_CH3_INT_CLR : WO; bitpos: [15]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH3_INT interrupt.
 */

#define LEDC_OVF_CNT_CH3_INT_CLR    (BIT(15))
#define LEDC_OVF_CNT_CH3_INT_CLR_M  (LEDC_OVF_CNT_CH3_INT_CLR_V << LEDC_OVF_CNT_CH3_INT_CLR_S)
#define LEDC_OVF_CNT_CH3_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH3_INT_CLR_S  15

/* LEDC_OVF_CNT_CH4_INT_CLR : WO; bitpos: [16]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH4_INT interrupt.
 */

