apache/nuttx/arch/risc-v/src/esp32c3-legacy/hardware/esp32c3_ledc.h
#define LEDC_OVF_CNT_CH4_INT_CLR    (BIT(16))
#define LEDC_OVF_CNT_CH4_INT_CLR_M  (LEDC_OVF_CNT_CH4_INT_CLR_V << LEDC_OVF_CNT_CH4_INT_CLR_S)
#define LEDC_OVF_CNT_CH4_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH4_INT_CLR_S  16

/* LEDC_OVF_CNT_CH5_INT_CLR : WO; bitpos: [17]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH5_INT interrupt.
 */

#define LEDC_OVF_CNT_CH5_INT_CLR    (BIT(17))
#define LEDC_OVF_CNT_CH5_INT_CLR_M  (LEDC_OVF_CNT_CH5_INT_CLR_V << LEDC_OVF_CNT_CH5_INT_CLR_S)
#define LEDC_OVF_CNT_CH5_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH5_INT_CLR_S  17

/* LEDC_OVF_CNT_CH6_INT_CLR : WO; bitpos: [18]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH6_INT interrupt.
 */

#define LEDC_OVF_CNT_CH6_INT_CLR    (BIT(18))
#define LEDC_OVF_CNT_CH6_INT_CLR_M  (LEDC_OVF_CNT_CH6_INT_CLR_V << LEDC_OVF_CNT_CH6_INT_CLR_S)
#define LEDC_OVF_CNT_CH6_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH6_INT_CLR_S  18

/* LEDC_OVF_CNT_CH7_INT_CLR : WO; bitpos: [19]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH7_INT interrupt.
 */

#define LEDC_OVF_CNT_CH7_INT_CLR    (BIT(19))
#define LEDC_OVF_CNT_CH7_INT_CLR_M  (LEDC_OVF_CNT_CH7_INT_CLR_V << LEDC_OVF_CNT_CH7_INT_CLR_S)
#define LEDC_OVF_CNT_CH7_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH7_INT_CLR_S  19

/* LEDC_CONF_REG register
 * Global ledc configuration register
 */

#define LEDC_CONF_REG (DR_REG_LEDC_BASE + 0xd0)

/* LEDC_APB_CLK_SEL : R/W; bitpos: [1:0]; default: 0;
 * This bit is used to select clock source for the 4 timers .
 *
 * 2'd1: APB_CLK 2'd2: RTC8M_CLK 2'd3: XTAL_CLK
 */

#define LEDC_APB_CLK_SEL    0x00000003
#define LEDC_APB_CLK_SEL_M  (LEDC_APB_CLK_SEL_V << LEDC_APB_CLK_SEL_S)
#define LEDC_APB_CLK_SEL_V  0x00000003
#define LEDC_APB_CLK_SEL_S  0

/* LEDC_CLK_EN : R/W; bitpos: [31]; default: 0;
 * This bit is used to control clock.
 *
 * 1'b1: Force clock on for register. 1'h0: Support clock only when
 * application writes registers.
 */

#define LEDC_CLK_EN    (BIT(31))
#define LEDC_CLK_EN_M  (LEDC_CLK_EN_V << LEDC_CLK_EN_S)
#define LEDC_CLK_EN_V  0x00000001
#define LEDC_CLK_EN_S  31

/* LEDC_DATE_REG register
 * Version control register
 */

#define LEDC_DATE_REG (DR_REG_LEDC_BASE + 0xfc)

/* LEDC_DATE : R/W; bitpos: [31:0]; default: 419898881;
 * This is the version control register.
 */

#define LEDC_DATE    0xFFFFFFFF
#define LEDC_DATE_M  (LEDC_DATE_V << LEDC_DATE_S)
#define LEDC_DATE_V  0xFFFFFFFF
#define LEDC_DATE_S  0

#endif /* __ARCH_RISCV_SRC_ESP32C3_LEGACY_HARDWARE_ESP32C3_LEDC_H */
